Revit 2024 API
Zone.DehumidificationSetPoint Property
Get or set the DeHumidification Set Point of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double DehumidificationSetPoint { get; set; }
Visual Basic
Public Property DehumidificationSetPoint As Double
	Get
	Set
Visual C++
public:
property double DehumidificationSetPoint {
	double get ();
	void set (double value);
}
Remarks
This property is used to get or set the DeHumidification Set Point of the Zone.
See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace